OpenFOAM-6-AP/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0/pyrolysisRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/pyrolysisRegion";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }

    coupledWall_side
    {
        type empty;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            filmPyrolysisRadiativeCoupledMixed;
        pyrolysisRegion pyrolysisRegion;
        filmRegion      filmRegion;
        Tnbr            T;
        kappaMethod     solidThermo;
        qrNbr           qr;
        qr              none;
        filmDeltaDry    0.0;
        filmDeltaWet    2e-4;
        value           uniform 298;
    }
    oneDEmptyPatch
    {
        type            empty;
    }

}


// ************************************************************************* //
